
# üìä Manipula√ß√£o de Tabelas com Pandas

## üìå Objetivo
Este notebook ensinar√° comandos b√°sicos para manipula√ß√£o de tabelas usando **Pandas**.
O objetivo √© aprender opera√ß√µes essenciais como:

- Visualizar estat√≠sticas b√°sicas
- Renomear colunas
- Selecionar colunas e linhas
- Remover dados indesejados

## üìä Manipulando dados

- Ap√≥s obter uma boa fonte de dados voc√™ certamente precisar√° realizar algumas limpezas e manipula√ß√µes para que os dados estejam no ponto ideal para as fases finais de uma an√°lise: execu√ß√£o de modelos econom√©tricos, visualiza√ß√µes de dados, tabelas agregadas, relat√≥rios etc.

- A realidade √© que, na pr√°tica, os dados nunca estar√£o do jeito que voc√™ de fato precisa. Portanto, √© fundamental dominar t√©cnicas de manipula√ß√£o de dados.

- Entendamos a manipula√ß√£o de dados como o ato de transformar, reestruturar, limpar, agregar e juntar os dados.

- Para se ter uma no√ß√£o da import√¢ncia dessa fase, alguns estudiosos da √°rea de Ci√™ncia de Dados costumam afirmar que 80% do trabalho √© encontrar uma boa fonte de dados, limpar e preparar os dados, sendo que os 20% restantes seriam o trabalho de aplicar modelos e realizar alguma an√°lise propriamente dita.


## üìÇ O Dataset: Penguins

Usaremos o dataset **Penguins**, fornecido pela biblioteca `seaborn`. Ele cont√©m informa√ß√µes sobre tr√™s esp√©cies de pinguins coletadas nas Ilhas Palmer.

### üìú Descri√ß√£o das Colunas:
- **species**: Esp√©cie do pinguim (*Adelie, Chinstrap, Gentoo*)
- **island**: Ilha onde o pinguim foi encontrado (*Biscoe, Dream, Torgersen*)
- **bill_length_mm**: Comprimento do bico em mil√≠metros
- **bill_depth_mm**: Profundidade do bico em mil√≠metros
- **flipper_length_mm**: Comprimento da nadadeira em mil√≠metros
- **body_mass_g**: Massa corporal do pinguim em gramas
- **sex**: Sexo do pinguim (*Male, Female*)

## üì• Importando Bibliotecas

In [1]:
import pandas as pd  # Biblioteca para manipula√ß√£o de dados
import seaborn as sns  # Biblioteca para carregar o dataset
import os

# A partir de agora vamos nos referir ao pandas apenas como pd e ao seaborn apenas como sns

## üìÇ Carregando e Explorando o Dataset

In [2]:

# Carregar o dataset 'penguins' do seaborn
df = sns.load_dataset('penguins')

# Exibir as primeiras 10 linhas da tabela para conhecer os dados
df.head(10)  # Mostra as 10 primeiras linhas da tabela para an√°lise inicial

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,Male
6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,Female
7,Adelie,Torgersen,39.2,19.6,195.0,4675.0,Male
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN

## üìä Informa√ß√µes B√°sicas da Tabela

In [3]:

# Verificar as colunas dispon√≠veis e seus tipos de dados
df.info()  # Mostra a estrutura do DataFrame, tipos de dados e valores nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [4]:

# Verificar se h√° valores ausentes no dataset
df.isnull().sum()  # Retorna a quantidade de valores nulos por coluna

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
dtype: int64

In [5]:

# Resumo estat√≠stico das colunas num√©ricas
df.describe()  # Mostra estat√≠sticas descritivas como m√©dia, desvio padr√£o e quartis
#Al√©m disso, √© bom tamb√©m para encontrar outliers
#As outras colunas como s√£o categ√≥ricas, n√£o sa√≠ram. Por √≥bvio s√≥ as que s√£o num√©ricas com decimal (float64) aparecem

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

## üìù Renomeando Colunas

In [6]:
#Renomeando algumas colunas
df = df.rename(columns={'species': 'especie', 'body_mass_g': 'massa_corporal_g','island':'ilha','sex':'sexo','flipper_length_mm':'nadadeira_mm'})

In [7]:

# Exibir os novos nomes das colunas ap√≥s a altera√ß√£o
df.columns  # Lista todas as colunas do DataFrame

Index(['especie', 'ilha', 'bill_length_mm', 'bill_depth_mm', 'nadadeira_mm',
       'massa_corporal_g', 'sexo'],
      dtype='object')

## üîç Selecionando Linhas e Colunas

In [8]:

# Selecionar apenas algumas colunas relevantes para an√°lise
df_subset = df[['especie', 'ilha', 'massa_corporal_g','sexo','nadadeira_mm']]
#Aqui mudei de df para df_subset, porque se tiver que refazer algo, eu n√£o preciso rodar o c√≥digo inteiro novamente

In [9]:
# Exibir as primeiras linhas da tabela reduzida
df_subset.head()  # Mostra as 5 primeiras linhas do subconjunto criado

  especie       ilha  massa_corporal_g    sexo  nadadeira_mm
0  Adelie  Torgersen            3750.0    Male         181.0
1  Adelie  Torgersen            3800.0  Female         186.0
2  Adelie  Torgersen            3250.0  Female         195.0
3  Adelie  Torgersen               NaN     NaN           NaN
4  Adelie  Torgersen            3450.0  Female         193.0

In [10]:
#Vamos transformar os valores da massa dos pinguins de gramas para quilos

df_subset.iloc[:,2]=df_subset.iloc[:,2]/1000 #iloc = index location
df_subset.head()

  especie       ilha  massa_corporal_g    sexo  nadadeira_mm
0  Adelie  Torgersen              3.75    Male         181.0
1  Adelie  Torgersen              3.80  Female         186.0
2  Adelie  Torgersen              3.25  Female         195.0
3  Adelie  Torgersen               NaN     NaN           NaN
4  Adelie  Torgersen              3.45  Female         193.0

In [11]:
#Agora vamos renomear novamente a coluna de g para kg

df_subset = df_subset.rename(columns={'massa_corporal_g': 'massa_corporal_kg'})
df_subset.head()

  especie       ilha  massa_corporal_kg    sexo  nadadeira_mm
0  Adelie  Torgersen               3.75    Male         181.0
1  Adelie  Torgersen               3.80  Female         186.0
2  Adelie  Torgersen               3.25  Female         195.0
3  Adelie  Torgersen                NaN     NaN           NaN
4  Adelie  Torgersen               3.45  Female         193.0

## üóëÔ∏è Removendo Colunas e Linhas

In [12]:

#Digamos que mudamos de ideia e nadadeiras n√£o √© mais importante
# Apagar a quinta coluna (√≠ndice 4) do dataset original
df_subset.pop(df_subset.columns[4])

df_subset.head()

  especie       ilha  massa_corporal_kg    sexo
0  Adelie  Torgersen               3.75    Male
1  Adelie  Torgersen               3.80  Female
2  Adelie  Torgersen               3.25  Female
3  Adelie  Torgersen                NaN     NaN
4  Adelie  Torgersen               3.45  Female

In [13]:
#Digamos que por algum motivo eu n√£o quero a quarta linha (√≠ndice 3) tamb√©m 
df_subset.drop(index=3, inplace=True)  # Remove a linha de √≠ndice 3 diretamente no df_subset, sem precisar criar uma nova vari√°vel
df_subset.head()

  especie       ilha  massa_corporal_kg    sexo
0  Adelie  Torgersen               3.75    Male
1  Adelie  Torgersen               3.80  Female
2  Adelie  Torgersen               3.25  Female
4  Adelie  Torgersen               3.45  Female
5  Adelie  Torgersen               3.65    Male

In [15]:
#Onde est√° o valor nulo da coluna massa_corporal_kg?

df_subset[df_subset["massa_corporal_kg"].isnull()]

    especie    ilha  massa_corporal_kg sexo
339  Gentoo  Biscoe                NaN  NaN

## üîÑ Lidando com Valores Nulos

In [16]:
# üìå Preencher valores nulos da coluna 'massa_corporal_kg' com a m√©dia da pr√≥pria coluna

df_subset['massa_corporal_kg'] = df_subset['massa_corporal_kg'].fillna(
    df_subset['massa_corporal_kg'].mean()  # Calculamos a m√©dia da coluna 'massa_corporal_kg' para substituir os valores nulos
)  # O m√©todo fillna() retorna uma nova Series com os NaNs preenchidos, e essa nova vers√£o √© salva na coluna original

# üìå Exibir as primeiras linhas para confirmar que os valores nulos foram preenchidos corretamente
df_subset.loc[339]  # acessa a linha cujo √≠ndice √© 339
#Aten√ß√£o, 339 n√£o quer dizer que √© 339¬∫, quer dizer que o √≠ndice tem o "nome" de 339

especie                Gentoo
ilha                   Biscoe
massa_corporal_kg    4.201754
sexo                      NaN
Name: 339, dtype: object

In [17]:
#Vamos ver se ainda temos valores nulos
df_subset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 343 entries, 0 to 343
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   especie            343 non-null    object
 1   ilha               343 non-null    object
 2   massa_corporal_kg  343 non-null    float64
 3   sexo               333 non-null    object
dtypes: float64(1), object(3)
memory usage: 21.5+ KB

In [18]:
#Poder√≠amos retirar a coluna sexo, mas digamos que ela √© importante para nossa an√°lise
#Como √© uma vari√°vel categ√≥rica, n√£o √© poss√≠vel plotarmos valores nulos, ent√£o vamos simplesmente apag√°-los
# Remover linhas que ainda contenham valores nulos
df_subset.dropna(inplace=True)  # Exclui qualquer linha que ainda tenha valores nulos
df_subset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 333 entries, 0 to 343
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   especie            333 non-null    object
 1   ilha               333 non-null    object
 2   massa_corporal_kg  333 non-null    float64
 3   sexo               333 non-null    object
dtypes: float64(1), object(3)
memory usage: 13.0+ KB

In [19]:
# Verificar novamente se h√° valores nulos
df_subset.isnull().sum()  # Confirma que n√£o h√° mais valores ausentes no dataset

especie              0
ilha                 0
massa_corporal_kg    0
sexo                 0
dtype: int64

## üî¢ Criando Novas Colunas

In [20]:

# Criar uma nova coluna 'leve', que indica se o pinguim √© mais leve que 4kg
df_subset['√â leve?'] = df_subset['massa_corporal_kg'] < 4  # Retorna True para pinguins abaixo da m√©dia

In [21]:

# Exibir as primeiras linhas para visualizar a nova coluna
df_subset.head()  # Confere a adi√ß√£o da nova coluna ao DataFrame

  especie       ilha  massa_corporal_kg    sexo  √â leve?
0  Adelie  Torgersen               3.75    Male     True
1  Adelie  Torgersen               3.80  Female     True
2  Adelie  Torgersen               3.25  Female     True
4  Adelie  Torgersen               3.45  Female     True
5  Adelie  Torgersen               3.65    Male     True

In [22]:
#Como provavelmente est√° em ordem crescente, vamos ver os √∫ltimos 10 valores e checar se a parte "pesado" est√° como falso
df_subset.tail(10)

    especie    ilha  massa_corporal_kg    sexo  √â leve?
332  Gentoo  Biscoe              4.650  Female    False
333  Gentoo  Biscoe              5.500    Male    False
334  Gentoo  Biscoe              4.375  Female    False
335  Gentoo  Biscoe              5.850    Male    False
337  Gentoo  Biscoe              6.000    Male    False
338  Gentoo  Biscoe              4.925  Female    False
340  Gentoo  Biscoe              4.850  Female    False
341  Gentoo  Biscoe              5.750    Male    False
342  Gentoo  Biscoe              5.200  Female    False
343  Gentoo  Biscoe              5.400    Male    False

In [23]:
#N√£o gostei do true ou false, vamos substituir por sim ou n√£o e tamb√©m traduzir os sexos
df_subset['√â leve?'] = df_subset['√â leve?'].replace({True: 'Sim', False: 'N√£o'})
df_subset['sexo'] = df_subset['sexo'].replace({"Female": 'F√™mea', "Male": 'Macho'})
df_subset.head()

  especie       ilha  massa_corporal_kg   sexo √â leve?
0  Adelie  Torgersen               3.75  Macho     Sim
1  Adelie  Torgersen               3.80  F√™mea     Sim
2  Adelie  Torgersen               3.25  F√™mea     Sim
4  Adelie  Torgersen               3.45  F√™mea     Sim
5  Adelie  Torgersen               3.65  Macho     Sim

## üíæ Salvando a Tabela Modificada

In [ ]:
df_subset.to_excel("pinguins.xlsx", index=False)  # Salva o arquivo sem o √≠ndice

from google.colab import files
files.download("pinguins.xlsx")  # Faz o download do arquivo